{
  "backend/main.mo": "Motoko backend defining data models, form validation logic, storage mixins, access control state, and form/user management maps.",
  "DEPLOYMENT.md": "Deployment guide describing how to deploy the application to the Internet Computer with separate public and admin URLs.",
  "feature_evidence.json": "Feature evidence report listing a frontend fix related to admin-page actor initialization and referencing affected components and tests.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing UI components, hooks, styling, and behavior across the app.",
  "frontend/env.json": "Environment configuration file with deployment instructions for IC mainnet and local development, including canister ID placeholders.",
  "frontend/index.html": "Base HTML file setting up the root element and global layout for the React application.",
  "frontend/src/App.tsx": "Main React app handling route detection, admin authentication flow, and conditional rendering of public form or admin dashboard.",
  "frontend/src/components/AddressAutocomplete.tsx": "Address autocomplete component integrating Mapy.cz and Nominatim APIs with suggestion dropdown and validation error styling.",
  "frontend/src/components/AdminLogin.tsx": "Admin login UI using Internet Identity with optional stay-signed-in checkbox and cancel action to return to the form.",
  "frontend/src/components/Footer.tsx": "Renders a footer with copyright text, a heart icon, and a link to caffeine.ai.",
  "frontend/src/components/FormList.tsx": "Displays a list of insurance forms with actions for viewing, deleting, exporting to CSV, and marking forms as viewed.",
  "frontend/src/components/Header.tsx": "Shows a fixed header with branding, a car image, and an optional envelope button for form management.",
  "frontend/src/components/InsuranceFormComponent.tsx": "Implements a large, stateful insurance form with validation, submission handling, and many input sections.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/SubmissionModal.tsx": "Modal for collecting sender name and email before final form submission, with validation and submit/cancel controls.",
  "frontend/src/components/VehicleAutocomplete.tsx": "Provides brand and model autocomplete inputs using local datasets with suggestion logic and UI handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, storing identity state, login flow, and providing context to the app.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for creating, fetching, deleting, and marking forms, integrating with actor calls and toast notifications.",
  "frontend/src/index.css": "Defines Tailwind layers, color variables, themes, and animations for global styling including light/dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color variables, animations, and plugins.",
  "project_state.json": "Describes project metadata, constraints, known issues, and required fixes related to admin form submission.",
  "unknown.txt": "Documentation describing admin features, deployment steps, production setup, and system behavior."
}